package by.epam.les04.main;

public class Task04 {
	//С помощью оператора while напишите программу вывода всех четных чисел в диапазоне от 2 до 100 включительно.

	public static void main(String[] args) {
		int i;
		i =2;
		while (i<=100) {
	
			
			System.out.println(i);
			i = i+2;
		}
}

}
