package by.epam.les04.main;

public class Task05 {
	// С помощью оператора while напишите программу определения суммы всех нечетных чисел в диапазоне от 1 до 99 включительно.
	public static void main(String[] args) {
		int i;
		i = 1;
		while (i<=99) {
	
			
			System.out.println(i);
			i = i+2;
		}
}
}
